#Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов. Сколько журавликов сделал каждый ребенок,
# если известно, что Петя и Сережа сделали одинаковое количество журавликов, а Катя сделала в два раза больше журавликов, 
# чем Петя и Сережа вместе?
number1 = int(input('Введите количество журавликов сделанных Петей или Сережей '))
number2 = number1*4
print('Количество журавликов сделанных Петей', number1)
print('Количество журавликов сделанных Сережей', number1)
print('Количество журавликов сделанных Катей', number2)